{
  "totalChunks": 11,
  "timestamp": "2025-03-20T01:10:54.803Z",
  "chunks": [
    {
      "text": "Introduction \nKarynn, Gabriel, Wesley, Hadley and Elanor. \nWhat  \nI was asked to speak about something I’ve recently studied or had on my mind. \nI’ve wrestled with these ideas for years now. This is the first time I’ve tried to bring them \ntogether in one place and explain them all at once. \n \nParaphrase \nJoshua 24: \n14   Now therefore fear the LORD, and serve him in sincerity and in truth: and put \naway the gods which your fathers served...  \n15... choose you this day whom ye will serve; ... as for me and my house, we will \nserve the LORD. \n \nUltimately we choose what to believe. Faith is choosing to believe in the Gospel \nof Jesus Christ. In this talk I’ll interchange belief and faith in reference to this idea.  \n \nWhy do we need to choose faith in Christ? Why doesn’t everyone believe in Him \nand His Gospel? Why do people struggle in the gospel? Why do I believe?  \nI’ve thought a lot about this. Bear with me, this is what I’ve come up with: It is \nbecause it is irrational to believe in Jesus Christ and His Gospel. \n \n● A definition of irrational is: not logical or reasonable. \n● A definition of rational is: based on or in accordance with reason or logic. \n \n In contrast, through the muddy cloud of emotion, our brains want to rationalize, \nreason and logic everything. We want things to make sense. We want to know the \nanswers to everything. Just a few relatable examples: \n \nWhen I was younger, my parents asked me to do a chore, or share with a sibling, \nor whatever, my first thought was, “Why? Why me?” \n \nI know the Jr high, and highschool students will relate to this. Whe",
      "fileName": "Talk 1_12_2025 (1).pdf",
      "metadata": {
        "totalPages": 6,
        "pageNumberLocation": 1,
        "chunkIndex": 0
      }
    },
    {
      "text": "en I was younger, my parents asked me to do a chore, or share with a sibling, \nor whatever, my first thought was, “Why? Why me?” \n \nI know the Jr high, and highschool students will relate to this. When you’re in \nmath class, and you’re asked to learn a new formula, or given homework, what is the \nmost common thing to hear, “When are we ever going to use math?” \n ",
      "fileName": "Talk 1_12_2025 (1).pdf",
      "metadata": {
        "totalPages": 6,
        "pageNumberLocation": 1,
        "chunkIndex": 1
      }
    },
    {
      "text": "At work, I had a really nice boss. He’d often ask us to complete tasks that made \nno sense and wouldn’t lead to higher sales numbers. In my mind while completing the \ntask I’d grumble “Why does he want me to do this?” \n \nIt’s just our nature. \n \nWe shouldn’t expect it to be any different in regards to believing in God. It’s part \nof our nature to have questions and as a result struggle with aspects of the gospel - and \nthat’s okay. We can take heart that this is what God intended: \n \nAlma 32:  \n21 And now as I said concerning faith—faith is not to have a perfect knowledge of \nthings; therefore if ye have faith ye hope for things which are not seen, which are true. \n \nI love this scripture. Because it is an assurance that we in fact do not see God \nthe Father, Jesus Christ, or the Holy Ghost. We don’t see the gold plates, ancient \nprophets, or biblical miracles. \n \nI want to take that a step further. I think more and more people are \nunderstandably concerned about certain gospel topics. So I’ll modify the scripture a bit: \n \n“Therefore if you have faith you hope for things which are not seen and seem kinda \ncrazy to believe, which are true” \n \nThere are numerous perfectly logical reasons to not believe in Jesus Christ and \nhis Gospel.  \n \nI’m sure you can each quickly think of five gospel related things that don’t make \nsense to you, or you have issues with. Perhaps you have wrestled with questions about \npolygamy, or tithing, or maybe a church leader has said something that really upset you, \nand you are told you have to sustain that leader. (Like can you give a talk) \n \n S",
      "fileName": "Talk 1_12_2025 (1).pdf",
      "metadata": {
        "totalPages": 6,
        "pageNumberLocation": 2,
        "chunkIndex": 2
      }
    },
    {
      "text": "stled with questions about \npolygamy, or tithing, or maybe a church leader has said something that really upset you, \nand you are told you have to sustain that leader. (Like can you give a talk) \n \n Someone I talked to just a month ago told me that she believed the law of \nMoses was all an apostasy, and that if it was truly inspired by God, it would change her \nopinion of him. \n \nUltimately it doesn’t make a lot of logical sense to believe a humble jewish \npreacher from 2000 years ago was murdered, brought himself back to life, and because \nof that we will all live a life after death. ",
      "fileName": "Talk 1_12_2025 (1).pdf",
      "metadata": {
        "totalPages": 6,
        "pageNumberLocation": 2,
        "chunkIndex": 3
      }
    },
    {
      "text": "Why\n \n \nWhy make this point? Why point out how “crazy” this all is. It’s to emphasize that \nwe do not get argued into believing the gospel is true. \nSo if believing in the gospel goes against our natural rational mind. Why do you \nbelieve?  \n \nIt is through the spirit, speaking to our spirit that we have evidence of the gospel. \nI fondly call my spiritual side, the irrational side. I can’t use it in an argument to \nprove anything. Rather, it is personal to me. \n \n When people talk about why they believe in the Gospel, they often talk about \nspiritual experiences. Can you think of a time when you felt the spirit strongly testify to \nyou? \n \n As a missionary we would read Moroni 10 verse 4 to our investigators: \n \nMoroni 10 \n4 And when ye shall receive these things, I would exhort you that ye would ask God, \nthe Eternal Father, in the name of Christ, if these things are not true; and if ye shall \nask with a sincere heart, with real intent, having faith in Christ, he will manifest the \ntruth of it unto you, by the power of the Holy Ghost.\n \n \nI had one investigator on my mission named Damon. He was a veteran of the \nsecond Iraq war. Understandably he had a lot of heavy things he carried with him. He’d \nclosed himself off from praying, and chose to stop believing in Jesus Christ.  \nWhen we went over to his house we read the Book of Mormon or watched a \ngeneral conference talk. For a long time he refused to pray. Little by little the spirit spoke \nto him. \nOne day we went over to his house, and he had the biggest smile on his face. He \nlet us know that he’d prayed like Moroni ha",
      "fileName": "Talk 1_12_2025 (1).pdf",
      "metadata": {
        "totalPages": 6,
        "pageNumberLocation": 3,
        "chunkIndex": 4
      }
    },
    {
      "text": "a long time he refused to pray. Little by little the spirit spoke \nto him. \nOne day we went over to his house, and he had the biggest smile on his face. He \nlet us know that he’d prayed like Moroni had told him to, and he’d received confirmation \nthat it was true. \nThese experiences serve as a start of a life of believing in the gospel. The spirit \nvisits the heart of the earnest seeker of truth to plant the seed of belief. \n \nIf you’ve felt something like this you know how amazing it is. I have on a couple \noccasions. However we cannot behave like a dog that would wander off and get lost if \nnot for the leash of the spirit. The burning of the bosom wears off. Things get hard. We \nstart questioning, “Did I really feel the spirit, or was I just caught up in the moment?” \n ",
      "fileName": "Talk 1_12_2025 (1).pdf",
      "metadata": {
        "totalPages": 6,
        "pageNumberLocation": 3,
        "chunkIndex": 5
      }
    },
    {
      "text": "Afterall, Laman and Lemuel saw an angel and still decided to rebel against God.  \n \nOliver Cowdry received a spiritual witness,\n “Did I not speak peace to your mind \nconcer[n]ing the matter?—What greater witness can you have than from God? ... \nDoubt not, fear not.” \n \nAnd yet for a time he was excommunicated from the church. \n \nDespite any spiritual experience you will be confronted with something that tests \nyour faith. Remember it’s part of our nature. There is something out there that could \nconvince you to leave your faith behind, if you let it. \n \nIn the end, our belief comes down to a choice. “Will I choose to stay? Will I \nchoose to believe in him?”  \nHow \nHow then do we choose to believe? I think Alma 32 is an excellent tutorial on the \nsubject, so I’ll read some more of it:  \n \n27 But behold, if ye will awake and arouse your faculties, even to an experiment upon \nmy words, and exercise a particle of faith, yea, even if ye can no more than desire to \nbelieve, let this desire work in you, even until ye believe in a manner that ye can give \nplace for a portion of my words. \n28 Now, we will compare the word unto a seed. Now, if ye give place, that a seed may \nbe planted in your heart, behold, if it be a true seed, or a good seed, if ye do not cast it \nout by your unbelief, that ye will resist the Spirit of the Lord, behold, it will begin to \nswell within your breasts; and when you feel these swelling motions, ye will begin to \nsay within yourselves—It must needs be that this is a good seed, or that the word is \ngood, for it beginneth to enlarge my soul; yea, it beginn",
      "fileName": "Talk 1_12_2025 (1).pdf",
      "metadata": {
        "totalPages": 6,
        "pageNumberLocation": 4,
        "chunkIndex": 6
      }
    },
    {
      "text": " when you feel these swelling motions, ye will begin to \nsay within yourselves—It must needs be that this is a good seed, or that the word is \ngood, for it beginneth to enlarge my soul; yea, it beginneth to enlighten my \nunderstanding, yea, it beginneth to be delicious to me. \n29 Now behold, would not this increase your faith? I say unto you, Yea; nevertheless \nit hath not grown up to a perfect knowledge. \n \nThis is what I referred to before about receiving a spiritual answer to prayer like my \ninvestigator Damon did. \n ",
      "fileName": "Talk 1_12_2025 (1).pdf",
      "metadata": {
        "totalPages": 6,
        "pageNumberLocation": 4,
        "chunkIndex": 7
      }
    },
    {
      "text": "37 And behold, as the tree beginneth to grow, ye will say: Let us nourish it with great \ncare, that it may get root, that it may grow up, and bring forth fruit unto us. And now \nbehold, if ye nourish it with much care it will get root, and grow up, and bring forth \nfruit. \n \nWe choose to believe by obeying the commandments. When we obey commandments \nwe nourish the tree. \n \n15   Beware of false prophets, which come to you in sheep’s clothing, but inwardly \nthey are ravening wolves. \n16 Ye shall know them by their fruits. Do men gather grapes of thorns, or figs of \nthistles? \n17 Even so every good tree bringeth forth good fruit; but a corrupt tree bringeth forth \nevil fruit. \n18 A good tree cannot bring forth evil fruit, neither can a corrupt tree bring forth good \nfruit. \n19 Every tree that bringeth not forth good fruit is hewn down, and cast into the fire. \n20 Wherefore by their fruits ye shall know them. \n \nThink to yourself: “Okay, had my initial testimony building experience (or are waiting for \nit) I chose to plant the seed and obey the commandments. I saw the tree grow, now \nwhat?” \n \nWhat are the fruits of you obeying the commandments? \n \n22 But the fruit of the Spirit is love, joy, peace, longsuffering, gentleness, goodness, \nfaith, \n23 Meekness, temperance \n \nThink right now. Have you felt these things in your life? Have you noticed their absence \nat times?  \n \nI can testify that when I obey the commandments, those fruits are abundant in my life. I \nmay have questions about gospel topics. Things may just not make sense. But I can’t \ndeny how the gospel makes me fee",
      "fileName": "Talk 1_12_2025 (1).pdf",
      "metadata": {
        "totalPages": 6,
        "pageNumberLocation": 5,
        "chunkIndex": 8
      }
    },
    {
      "text": "estify that when I obey the commandments, those fruits are abundant in my life. I \nmay have questions about gospel topics. Things may just not make sense. But I can’t \ndeny how the gospel makes me feel. \n \n They aren’t as dramatic or noticeable as an initial testimony starting experience. \nInstead they are a sweet peace that comes with every day I obey. ",
      "fileName": "Talk 1_12_2025 (1).pdf",
      "metadata": {
        "totalPages": 6,
        "pageNumberLocation": 5,
        "chunkIndex": 9
      }
    },
    {
      "text": " \nI’ll conclude with a brief summary of my thoughts. \n● It is up to us to choose to believe in Jesus Christ and his gospel. \n● We should not be surprised when our rational brains have a question, or doubt \nas it is in our nature to question. We don’t believe because the gospel makes a \ngood argument, but rather because the spirit testifies to our spirits. \n● We choose to believe by keeping the commandments. \n● We are blessed with the fruits of the spirit when we keep the commandments. \n \n \n \n ",
      "fileName": "Talk 1_12_2025 (1).pdf",
      "metadata": {
        "totalPages": 6,
        "pageNumberLocation": 6,
        "chunkIndex": 10
      }
    }
  ]
}